public/man/man1/rnano.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - rnano.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - rnano.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>rnano - a restricted nano</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>rnano</strong> [/options/] <a href="+/line/[,/column/">+/line/[,/column/</a> /file/]…</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>rnano</strong> runs the <strong>nano</strong> editor in restricted mode. This allows editing
only the specified file or files, and doesn&#39;t allow the user access to
the filesystem nor to a command shell.</p>
<p>
In restricted mode, <strong>nano</strong> will:</p>
<ul>
<li>not make backups;</li>
<li>not allow suspending;</li>
<li>not allow spell checking;</li>
<li>not read nor write the history files;</li>
<li>not allow saving the current buffer under a different name;</li>
<li>not allow inserting another file or opening a new buffer;</li>
<li>not allow appending or prepending to any file.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<dl>
<dt>
<strong>-h</strong>, <strong>–help</strong>
</dt>
<dd>Show the available command-line options and exit.</dd>
</dl>
<p>For all existing options, see the *nano*(1) man page.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
BUGS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Please report bugs via <em><a href="https://savannah.gnu.org/bugs">https://savannah.gnu.org/bugs</a></em>?group=nano/.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
HOMEPAGE
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><em><a href="https://nano-editor.org/">https://nano-editor.org/</a></em></p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*nano*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
